app/controllers/tweets_controller.rb

    def index
      @tweets = Tweet.includes(:user).page(params[:page]).per(5).order("created_at DESC")
---
SELECT  `tweets`.* FROM `tweets`  ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `tweets`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1)

    def create
      Tweet.create(image: tweet_params[:image], text: tweet_params[:text], user_id: current_user.id)
---
INSERT INTO `tweets` (`name`, `image`, `text`, `user_id`, `created_at`, `updated_at`) VALUES ('tora', 'https://tech-master.s3.amazonaws.com/uploads/curriculums/images/Rails1-6/008.jpg', '猫だにゃん', 1, '2018-08-21 06:33:34', '2018-08-21 06:33:34')

    def destroy
      tweet.destroy if tweet_url == current_user.id
---
DELETE FROM `tweets` WHERE `tweets`.`id` = 17

    def edit
      @tweet =Tweet.find(id_params[:id])
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 17 LIMIT 1

    def update
      tweet = Tweet.find(id_params[:id])
      tweet.update(tweet_params) if tweet.id == current_user.id
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 17 LIMIT 1
UPDATE `tweets` SET `text` = '今日は夜から雨です。', `updated_at` = '2018-08-23 03:20:48' WHERE `tweets`.`id` = 17